# Importing Libraries

In [5]:
import pandas as pd
import numpy as np

In [6]:
s = pd.Series([1, 2 ,3 ,4 ,5 ,6 ,7 , np.nan, 8, 9 ])
s

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
7    NaN
8    8.0
9    9.0
dtype: float64

In [9]:
d= pd.date_range('20210610', periods = 10)
d

DatetimeIndex(['2021-06-10', '2021-06-11', '2021-06-12', '2021-06-13',
               '2021-06-14', '2021-06-15', '2021-06-16', '2021-06-17',
               '2021-06-18', '2021-06-19'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df = pd.DataFrame(np.random.randn(10,4), index = d, columns  =['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2021-06-10 -0.452301  0.269629  1.123197  0.005899
2021-06-11  0.718935 -0.324157  0.490302 -2.165880
2021-06-12 -0.388509 -0.043575 -2.193133  1.666281
2021-06-13  0.093864 -0.286944 -1.846053 -0.661246
2021-06-14 -1.036516  1.178059  0.803445 -0.215513
2021-06-15  2.228319 -0.393013 -0.014595  1.471441
2021-06-16 -0.509084  0.229135  0.760553  1.593855
2021-06-17  0.323459  0.742179  0.418076  0.737782
2021-06-18 -0.390164  0.449439 -0.941449 -0.106143
2021-06-19  0.191984 -0.483259 -1.079732 -0.351373

In [19]:
df = pd.DataFrame({'A':[1,2,3,4],
                  'B': pd.Timestamp('20210610'),
                  'C': pd.Series(1, index= list(range(4)), dtype = 'float32'),
                  'D': np.array([5]*4, dtype = 'int32'),
                  'E': pd.Categorical(['T', 'F', 'T', 'F']),
                  'F':  'Amisha'})
df

   A          B    C  D  E       F
0  1 2021-06-10  1.0  5  T  Amisha
1  2 2021-06-10  1.0  5  F  Amisha
2  3 2021-06-10  1.0  5  T  Amisha
3  4 2021-06-10  1.0  5  F  Amisha

In [22]:
df.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [23]:
df.head()

   A          B    C  D  E       F
0  1 2021-06-10  1.0  5  T  Amisha
1  2 2021-06-10  1.0  5  F  Amisha
2  3 2021-06-10  1.0  5  T  Amisha
3  4 2021-06-10  1.0  5  F  Amisha

In [24]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [25]:
df.to_numpy()

array([[1, Timestamp('2021-06-10 00:00:00'), 1.0, 5, 'T', 'Amisha'],
       [2, Timestamp('2021-06-10 00:00:00'), 1.0, 5, 'F', 'Amisha'],
       [3, Timestamp('2021-06-10 00:00:00'), 1.0, 5, 'T', 'Amisha'],
       [4, Timestamp('2021-06-10 00:00:00'), 1.0, 5, 'F', 'Amisha']],
      dtype=object)

In [26]:
df.describe()

              A    C    D
count  4.000000  4.0  4.0
mean   2.500000  1.0  5.0
std    1.290994  0.0  0.0
min    1.000000  1.0  5.0
25%    1.750000  1.0  5.0
50%    2.500000  1.0  5.0
75%    3.250000  1.0  5.0
max    4.000000  1.0  5.0

In [27]:
df.sort_index(axis = 1, ascending = False)

        F  E  D    C          B  A
0  Amisha  T  5  1.0 2021-06-10  1
1  Amisha  F  5  1.0 2021-06-10  2
2  Amisha  T  5  1.0 2021-06-10  3
3  Amisha  F  5  1.0 2021-06-10  4

In [30]:
df.sort_values(by = 'A')

   A          B    C  D  E       F
0  1 2021-06-10  1.0  5  T  Amisha
1  2 2021-06-10  1.0  5  F  Amisha
2  3 2021-06-10  1.0  5  T  Amisha
3  4 2021-06-10  1.0  5  F  Amisha